Revit 2024 API
FailureMessage.GetDescriptionText Method
 Retrieves the description text of the failure.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public string GetDescriptionText()
Visual Basic
Public Function GetDescriptionText As String
Visual C++
public:
String^ GetDescriptionText()
Return Value
 The description text.
See Also
FailureMessage Class
Autodesk.Revit.DB Namespace